app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::orderBy('created_at', 'ASC')->paginate();
---
select count(*) as aggregate from `posts`